Revit 2027 API
ParameterTypeId.PipingGenderType Property
 "Gender Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PipingGenderType { get; }
Public Shared ReadOnly Property PipingGenderType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PipingGenderType {
	ForgeTypeId^ get ();
}
static member PipingGenderType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace